TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/empty_driverlib_src/ti/driverlib/dl_mcan.h
/**
 *  @brief   This API is used to get ECC interrupt status.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  errType  Interrupt status to read.
 *                       One of @ref DL_MCAN_ECC_ERR_TYPE.
 *
 *  @return  None.
 */
uint32_t DL_MCAN_eccGetIntrStatus(const MCAN_Regs *mcan, uint32_t errType);

/**
 *  @brief   This API is used to clear ECC interrupt status.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  errType  Interrupt status to clear.
 *                       One of @ref DL_MCAN_ECC_ERR_TYPE.
 *
 *  @return  None.
 */
void DL_MCAN_eccClearIntrStatus(MCAN_Regs *mcan, uint32_t errType);

/**
 *  @brief   This API will configure external timestamp counter for MCAN module.
 *
 *  @param[in]  mcan        Pointer to the register overlay for the peripheral
 *  @param[in]  prescalar   Timestamp Counter Prescaler. Range:[0x0-0xFFFFFF]
 *
 *  @return  None.
 *
 * \note    Actual value programmed prescalar values is (prescalar - 1).
 */
void DL_MCAN_extTSCounterConfig(MCAN_Regs *mcan, uint32_t prescalar);

/**
 *  @brief   This API will enable/disable fast external time stamp counter for
 *          MCAN module.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  enable  External TS is enabled if it is TRUE.
 *                      External TS is disabled if it is FALSE.
 *
 *  @return  None.
 */
void DL_MCAN_extTSCounterEnable(MCAN_Regs *mcan, bool enable);

/**
 *  @brief   This API will enable/disable External TimeStamp Counter
 *           Overflow Interrupt for MCAN module.
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  enable  External TimeStamp Counter Overflow Interrupt is
 *                      enabled if it is TRUE.
 *                      External TimeStamp Counter Overflow Interrupt is
 *                      disabled if it is FALSE.
 *
 *  @return  None.
 */
void DL_MCAN_extTSEnableIntr(MCAN_Regs *mcan, bool enable);

/**
 *  @brief   This API is used to write End of Interrupt for External TimeStamp
 *          Counter Overflow Interrupt.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  None.
 */
void DL_MCAN_extTSWriteEOI(MCAN_Regs *mcan);

/**
 *  @brief   This API returns Number of unserviced rollover/overflow
 *          interrupts for external TimeStamp counter.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status   Returns Number of unserviced rollover/overflow
 *                    interrupts for external TimeStamp counter.
 *                    Maximum number of unserviced interrupts is 0xF.
 */
uint32_t DL_MCAN_extTSGetUnservicedIntrCount(const MCAN_Regs *mcan);

/* ========================================================================== */
/*                          Advance Functions                                 */
/* ========================================================================== */

/**
 *  @brief   This API is used get the MCAN revision ID.
 *
 *  @param[in]  mcan     Pointer to the register overlay for the peripheral
 *  @param[in]  revId    Contains Revision ID of MCAN module.
 *                       @ref DL_MCAN_RevisionId.
 *
 *  @return  None.
 */
void DL_MCAN_getRevisionId(const MCAN_Regs *mcan, DL_MCAN_RevisionId *revId);

/**
 *  @brief   This API get clock stop acknowledgement for MCAN module.
 *          It return whether MCAN is power down mode or not.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status  Return Clock Stop Acknowledgement status.
 *                   Return '1' if M_CAN is set in power down mode else
 *                   returns '0'.
 */
uint32_t DL_MCAN_getClockStopAck(const MCAN_Regs *mcan);

/**
 *  @brief   This API will set External TimeStamp Counter Overflow Interrupt
 *          Raw status for MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  None.
 */
void DL_MCAN_extTSSetRawStatus(MCAN_Regs *mcan);

/**
 *  @brief   This API will clear External TimeStamp Counter Overflow Interrupt
 *          raw status for MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  None.
 */
void DL_MCAN_extTSClearRawStatus(MCAN_Regs *mcan);

/**
 *  @brief   This API will return Rx pin state of MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  state    MCAN Rx Pin State.
 *                    0= The CAN bus is dominant
 *                    1= The CAN bus is recessive
 */
uint32_t DL_MCAN_getRxPinState(const MCAN_Regs *mcan);

/**
 *  @brief   This API will set Tx pin state of MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *  @param[in]  state MCAN Tx Pin State.
 *                    00= Reset value
 *                    01= Sample Point can be monitored at tx pin
 *                    10= The CAN bus is dominant
 *                    11= The CAN bus is recessive
 *                    other= It will treated as 11.
 *
 *  @return  None.
 */
void DL_MCAN_setTxPinState(MCAN_Regs *mcan, uint32_t state);

/**
 *  @brief   This API will return Tx pin state of MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  state    MCAN Tx Pin State.
 *                    00= Reset value
 *                    01= Sample Point can be monitored at tx pin
 *                    10= The CAN bus is dominant
 *                    11= The CAN bus is recessive
 */
uint32_t DL_MCAN_getTxPinState(const MCAN_Regs *mcan);

/**
 *  @brief   This API will return current timestamp counter value.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  val             Current Timestamp counter value.
 */
uint32_t DL_MCAN_getTSCounterVal(const MCAN_Regs *mcan);

/**
 *  @brief   This API will return clock stop acknowledgement
 *          for MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  ack   Clock Stop Acknowledge
 *                 0= No clock stop acknowledged
 *                 1= M_CAN may be set in power down
 */
uint32_t DL_MCAN_getClkStopAck(const MCAN_Regs *mcan);

/**
 *  @brief   This API will get the configured bit timings for MCAN module.
 *
 *  @param[in]  mcan          Pointer to the register overlay for the peripheral
 *  @param[in]  configParams  Configuration parameters for MCAN bit timing.
 *                            @ref DL_MCAN_BitTimingParams.
 *
 *  @return  None.
 */
void DL_MCAN_getBitTime(
    const MCAN_Regs *mcan, DL_MCAN_BitTimingParams *configParams);

/**
 *  @brief   This API will reset timestamp counter value.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  None.
 */
void DL_MCAN_resetTSCounter(MCAN_Regs *mcan);

/**
 *  @brief   This API will return current time-out counter value.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  val      Current Time-out counter value.
 */
uint32_t DL_MCAN_getTOCounterVal(const MCAN_Regs *mcan);

/**
 *  @brief   This API is used get the ECC AGGR revision ID.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *  @param[in]  revId Contains Revision ID of ECC AGGR.
 *                    @ref DL_MCAN_ECCAggrRevisionId.
 *
 *  @return  None.
 */
void DL_MCAN_eccAggrGetRevisionId(
    const MCAN_Regs *mcan, DL_MCAN_ECCAggrRevisionId *revId);

/**
 *  @brief   This API is used get the ECC Wrapper revision ID.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *  @param[in]  revId Contains Revision ID of ECC Wrapper
 *                    @ref DL_MCAN_ECCWrapRevisionId.
 *
 *  @return  None.
 */
void DL_MCAN_eccWrapGetRevisionId(
    MCAN_Regs *mcan, DL_MCAN_ECCWrapRevisionId *revId);

/**
 *  @brief   This API returns External TimeStamp Counter Overflow Interrupt
 *          enable status for MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  status   Returns TRUE if External TimeStamp Counter Overflow
 *                    Interrupt is enabled.
 *                    Else returns FALSE.
 */
bool DL_MCAN_extTSIsIntrEnable(const MCAN_Regs *mcan);

/**
 *  @brief   This function return endianness value of MCAN module.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 * @retval  val             Endianness value. (0x87654321)
 */
uint32_t DL_MCAN_getEndianVal(const MCAN_Regs *mcan);

/**
 *  @brief   This API will get the configured Extended ID AND Mask.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return  idMask          Extended ID AND Mask.
 */
uint32_t DL_MCAN_getExtIDANDMask(const MCAN_Regs *mcan);

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the MCAN
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  @param mcan         Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_MCAN_enablePower(MCAN_Regs *mcan)
{
    mcan->MCANSS.PWREN = (MCAN_PWREN_KEY_UNLOCK_W | MCAN_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the MCAN
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @note This API does not provide large power savings.
 *
 *  @param mcan         Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_MCAN_disablePower(MCAN_Regs *mcan)
{
    mcan->MCANSS.PWREN = (MCAN_PWREN_KEY_UNLOCK_W | MCAN_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the MCAN
 *        is enabled
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @param mcan         Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral register access is enabled
 * @return false if peripheral register access is disabled
 */
__STATIC_INLINE bool DL_MCAN_isPowerEnabled(const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.PWREN & MCAN_PWREN_ENABLE_MASK) ==
            MCAN_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets mcan peripheral
 *
 *  @param mcan         Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_MCAN_reset(MCAN_Regs *mcan)
{
    mcan->MCANSS.RSTCTL =
        (MCAN_RSTCTL_KEY_UNLOCK_W | MCAN_RSTCTL_RESETSTKYCLR_CLR |
            MCAN_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if mcan peripheral was reset
 *
 *  @param mcan         Pointer to the register overlay for the peripheral
 *
 *  @return true if peripheral was reset
 *  @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_MCAN_isReset(const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.STAT & MCAN_STAT_RESETSTKY_MASK) ==
            MCAN_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enable MCAN interrupts
 *
 *  @param[in]  mcan           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_MCAN_INTERRUPT.
 */
__STATIC_INLINE void DL_MCAN_enableInterrupt(
    MCAN_Regs *mcan, uint32_t interruptMask)
{
    mcan->MCANSS.TI_WRAPPER.MSP.CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable MCAN interrupts
 *
 *  @param[in]  mcan           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
 *                             mcan interrupts.
 */
__STATIC_INLINE void DL_MCAN_disableInterrupt(
    MCAN_Regs *mcan, uint32_t interruptMask)
{
    mcan->MCANSS.TI_WRAPPER.MSP.CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which MCAN interrupts are enabled
 *
 *  @param[in]  mcan           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_MCAN_INTERRUPT.
 *
 *  @return     Which of the requested MCAN interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_MCAN_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_MCAN_getEnabledInterrupts(
    const MCAN_Regs *mcan, uint32_t interruptMask)
{
    return (mcan->MCANSS.TI_WRAPPER.MSP.CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled MCAN interrupts
 *
 *  Checks if any of the MCAN interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  mcan           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_MCAN_INTERRUPT.
 *
 *  @return     Which of the requested MCAN interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_MCAN_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_MCAN_getEnabledInterruptStatus(
    const MCAN_Regs *mcan, uint32_t interruptMask)
{
    return (mcan->MCANSS.TI_WRAPPER.MSP.CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any MCAN interrupt
 *
 *  Checks if any of the MCAN interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  mcan           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_MCAN_INTERRUPT.
 *
 *  @return     Which of the requested MCAN interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_MCAN_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_MCAN_getRawInterruptStatus(
    const MCAN_Regs *mcan, uint32_t interruptMask)
{
    return (mcan->MCANSS.TI_WRAPPER.MSP.CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending MCAN interrupt
 *
 *  Checks if any of the MCAN interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     The highest priority pending MCAN interrupt. One of
 *              @ref DL_MCAN_IIDX
 *
 */
__STATIC_INLINE DL_MCAN_IIDX DL_MCAN_getPendingInterrupt(const MCAN_Regs *mcan)
{
    // TODO: Need to figure out return values for this.
    return ((DL_MCAN_IIDX) mcan->MCANSS.TI_WRAPPER.MSP.CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending MCAN interrupts
 *
 *  @param[in]  mcan           Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_MCAN_INTERRUPT.
 */
__STATIC_INLINE void DL_MCAN_clearInterruptStatus(
    MCAN_Regs *mcan, uint32_t interruptMask)
{
    mcan->MCANSS.TI_WRAPPER.MSP.CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief      Checks if the MCAN module clock request is enabled
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     If the MCAN module clock request is enabled
 *
 */
__STATIC_INLINE bool DL_MCAN_isModuleClockEnabled(const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKEN &
                MCAN_CLKEN_CLK_REQEN_MASK) == MCAN_CLKEN_CLK_REQEN_SET);
}

/**
 *  @brief      Enables the MCAN functional module clock
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_enableModuleClock(MCAN_Regs *mcan)
{
    mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKEN = MCAN_CLKEN_CLK_REQEN_SET;
}

/**
 *  @brief      Disables the MCAN functional module clock
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_disableModuleClock(MCAN_Regs *mcan)
{
    mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKEN = MCAN_CLKEN_CLK_REQEN_CLR;
}

/**
 *  @brief      Gets the MCAN functional module clock divide ratio
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     The current clock divide ratio, one of @ref DL_MCAN_CLOCK_DIVIDE
 *
 */
__STATIC_INLINE uint32_t DL_MCAN_getModuleClockDivider(const MCAN_Regs *mcan)
{
    return (
        mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKDIV & MCAN_CLKDIV_RATIO_MASK);
}

/**
 *  @brief      Configures clock divide settings for the MCAN functional module
 *              clock
 *
 *  @param[in]  mcan    Pointer to the register overlay for the peripheral
 *  @param[in]  clkdiv  The desired clock divide ratio, one of
 *                      @ref DL_MCAN_CLOCK_DIVIDE
 *
 */
__STATIC_INLINE void DL_MCAN_setModuleClockDivider(
    MCAN_Regs *mcan, uint32_t clkdiv)
{
    DL_Common_updateReg(&mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKDIV, clkdiv,
        MCAN_CLKDIV_RATIO_MASK);
}

/**
 *  @brief      Checks if the MCAN clock gating request is enabled
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     If the the MCAN module clock gating request is enabled/disabled
 *
 */
__STATIC_INLINE bool DL_MCAN_isClockStopGateRequestEnabled(
    const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL &
                MCAN_CLKCTL_STOPREQ_MASK) == MCAN_CLKCTL_STOPREQ_ENABLE);
}

/**
 *  @brief      Enables the MCAN clock gating request
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_enableClockStopGateRequest(MCAN_Regs *mcan)
{
    DL_Common_updateReg(&mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL,
        MCAN_CLKCTL_STOPREQ_ENABLE, MCAN_CLKCTL_STOPREQ_MASK);
}

/**
 *  @brief      Disables the MCAN clock gating request
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_disableClockStopGateRequest(MCAN_Regs *mcan)
{
    DL_Common_updateReg(&mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL,
        MCAN_CLKCTL_STOPREQ_DISABLE, MCAN_CLKCTL_STOPREQ_MASK);
}

/**
 *  @brief      Checks if the MCAN clock stop wakeup interrupt is enabled
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     If the the MCAN module clock wakeup interrupt is
 *              enabled/disabled
 *
 */
__STATIC_INLINE bool DL_MCAN_isClockStopWakeupInterruptEnabled(
    const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL &
                MCAN_CLKCTL_WAKEUP_INT_EN_MASK) ==
            MCAN_CLKCTL_WAKEUP_INT_EN_ENABLE);
}

/**
 *  @brief      Enables the MCAN clock stop wakeup interrupt
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_enableClockStopWakeupInterrupt(MCAN_Regs *mcan)
{
    DL_Common_updateReg(&mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL,
        MCAN_CLKCTL_WAKEUP_INT_EN_ENABLE, MCAN_CLKCTL_WAKEUP_INT_EN_MASK);
}

/**
 *  @brief      Disables the MCAN clock stop wakeup interrupt
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_disableClockStopWakeupInterrupt(MCAN_Regs *mcan)
{
    DL_Common_updateReg(&mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL,
        MCAN_CLKCTL_WAKEUP_INT_EN_DISABLE, MCAN_CLKCTL_WAKEUP_INT_EN_MASK);
}

/**
 *  @brief      Checks if the glitch filter on MCAN RXD input is enabled
 *
 *  When the glitch filter is enabled in MCAN RXD input, it wakes up the MCAN
 *  controller to exit clock gating
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     If the the glitch filter on MCAN RXD input is enabled/disabled
 *
 */
__STATIC_INLINE bool DL_MCAN_isGlitchFilterWakeupEnabled(const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL &
                MCAN_CLKCTL_WKUP_GLTFLT_EN_MASK) ==
            MCAN_CLKCTL_WKUP_GLTFLT_EN_ENABLE);
}

/**
 *  @brief      Enables the glitch filter on MCAN RXD input
 *
 *  When the glitch filter is enabled in MCAN RXD input, it wakes up the MCAN
 *  controller to exit clock gating
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_enableGlitchFilterWakeup(MCAN_Regs *mcan)
{
    DL_Common_updateReg(&mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL,
        MCAN_CLKCTL_WKUP_GLTFLT_EN_ENABLE, MCAN_CLKCTL_WKUP_GLTFLT_EN_MASK);
}

/**
 *  @brief      Disables the glitch filter on MCAN RXD input
 *
 *  When the glitch filter is enabled in MCAN RXD input, it wakes up the MCAN
 *  controller to exit clock gating
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_MCAN_disableGlitchFilterWakeup(MCAN_Regs *mcan)
{
    DL_Common_updateReg(&mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKCTL,
        MCAN_CLKCTL_WKUP_GLTFLT_EN_DISABLE, MCAN_CLKCTL_WKUP_GLTFLT_EN_MASK);
}

/**
 *  @brief      Gets the clock stop acknowledge status
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     The clock stop acknowledge status
 *
 */
__STATIC_INLINE bool DL_MCAN_getClockStopAcknowledgeStatus(
    const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKSTS &
                MCAN_CLKSTS_CLKSTOP_ACKSTS_MASK) ==
            MCAN_CLKSTS_CLKSTOP_ACKSTS_SET);
}

/**
 *  @brief      Gets the clock stop hardware override status
 *
 *  This bit indicates when the MCANSS_CLKCTL.STOPREQ bit has been cleared by
 *  HW when a clock-stop wake-up event via CAN RX activity is triggered
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     The clock stop hardware override status
 *
 */
__STATIC_INLINE bool DL_MCAN_getClockStopHardwareOverrideStatus(
    const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKSTS &
                MCAN_CLKSTS_STOPREQ_HW_OVR_MASK) ==
            MCAN_CLKSTS_STOPREQ_HW_OVR_SET);
}

/**
 *  @brief      Gets the status of MCAN controller clock request from GPRCM
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of the MCAN controller clock request from GPRCM
 *
 */
__STATIC_INLINE bool DL_MCAN_getControllerClockRequestStatus(
    const MCAN_Regs *mcan)
{
    return ((mcan->MCANSS.TI_WRAPPER.MSP.MCANSS_CLKSTS &
                MCAN_CLKSTS_CCLKDONE_MASK) == MCAN_CLKSTS_CCLKDONE_SET);
}

/**
 *  @brief      Saves MCAN configuration before entering STOP or STANDBY mode.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  ptr   Configuration backup setup structure. See
 *                       @ref DL_MCAN_backupConfig.
 *
 *  @retval     FALSE if a configuration already exists in ptr (will not be
 *              overwritten). TRUE if a configuration was successfully saved
 *
 */
bool DL_MCAN_saveConfiguration(
    const MCAN_Regs *mcan, DL_MCAN_backupConfig *ptr);

/**
 *  @brief      Restore MCAN configuration after leaving STOP or STANDBY mode.
 *
 *  @param[in]  mcan  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  ptr      Configuration backup setup structure. See
 *                       @ref DL_MCAN_backupConfig.
 *
 *  @retval     FALSE if a configuration does not exist in ptr (will not be
 *              loaded). TRUE if a configuration successfully loaded
 *
 */
bool DL_MCAN_restoreConfiguration(MCAN_Regs *mcan, DL_MCAN_backupConfig *ptr);

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_MCAN__ */

#endif /* ti_dl_dl_mcan__include */
/** @}*/
